AccumulationRegisters/ПереработкаПоГрафикуПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ПереработкаПоГрафикуПроизводства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КЗаказу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтрокиЭтапыГрафик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЭтапыПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ЭтапыПроизводства</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗапланированоЗаказом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапланированоПроизводством</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КВыполнению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Брак</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоПредварительногоБуфера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеЗавершающегоБуфера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСледующегоЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводствоНаСтороне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтрокиПродукция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСтрокиЭтапыГрафик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроизводства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПереработкаПоГрафикуПроизводства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура отражает в регистре ЭтапыПроизводства факт оформления заказа переработчику
//
// Параметры:
//  ТаблицаЭтаповГрафика - ТаблицаЗначений - таблица этапов производства на стороне, по которым необходимо
//                                             зафиксировать факт оформления заказа переработчику
//    * Распоряжение - ДокументСсылка.ЗаказНаПроизводство - заказ на производство
//    * КодСтрокиЭтапыГрафик - Число - код строки этапа графика производства
//  ВызовИзОбработчикаОбновления - Булево - признак, что вызов выполняется из обработчика обновления
//
Процедура ЗафиксироватьВводЗаказаПереработчикуПоЭтапамПроизводства(ТаблицаЭтаповГрафика, ВызовИзОбработчикаОбновления = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТаблицаЭтаповГрафика) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.Распоряжение         КАК Распоряжение,
	|	Т.КодСтрокиЭтапыГрафик КАК КодСтрокиЭтапыГрафик
	|ПОМЕСТИТЬ ВТ_ЭтапыПереработки
	|ИЗ
	|	&ТаблицаЭтаповГрафика КАК Т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение,
	|	КодСтрокиЭтапыГрафик
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыПроизводства.Распоряжение                         КАК Распоряжение,
	|	ЭтапыПроизводства.КодСтрокиПродукция                   КАК КодСтрокиПродукция,
	|	ЭтапыПроизводства.КодСтрокиЭтапыГрафик                 КАК КодСтрокиЭтапыГрафик,
	|	ЭтапыПроизводства.Этап                                 КАК Этап,
	|	ЭтапыПроизводства.Подразделение                        КАК Подразделение,
	|	СУММА(ЭтапыПроизводства.ЗапланированоЗаказом)
	|	 - СУММА(ЭтапыПроизводства.Выполнено)                  КАК ЗапланированоОстаток
	|
	|ПОМЕСТИТЬ ВТ_ОстаткиЭтапов
	|
	|ИЗ
	|	РегистрНакопления.ЭтапыПроизводства КАК ЭтапыПроизводства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЭтапыПереработки КАК ЭтапыПереработки
	|		ПО ЭтапыПроизводства.Распоряжение = ЭтапыПереработки.Распоряжение
	|			И ЭтапыПроизводства.КодСтрокиЭтапыГрафик = ЭтапыПереработки.КодСтрокиЭтапыГрафик
	|
	|ГДЕ
	|	ЭтапыПроизводства.ПроизводствоНаСтороне
	|	И ЭтапыПроизводства.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыПроизводства.Распоряжение,
	|	ЭтапыПроизводства.КодСтрокиПродукция,
	|	ЭтапыПроизводства.КодСтрокиЭтапыГрафик,
	|	ЭтапыПроизводства.Этап,
	|	ЭтапыПроизводства.Подразделение
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЭтапыПроизводства.ЗапланированоЗаказом)
	|	 - СУММА(ЭтапыПроизводства.Выполнено) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение,
	|	КодСтрокиЭтапыГрафик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереработкаПоГрафикуПроизводства.Распоряжение         КАК Распоряжение,
	|	ПереработкаПоГрафикуПроизводства.КодСтрокиЭтапыГрафик КАК КодСтрокиЭтапыГрафик,
	|	ПереработкаПоГрафикуПроизводства.Регистратор          КАК Регистратор,
	|	ЗаказПереработчику.Дата                               КАК Период
	|ПОМЕСТИТЬ ВТ_ПереработкаПоГрафикуПроизводства
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПереработкаПоГрафикуПроизводства.ЗаказНаПроизводство КАК Распоряжение,
	|		ПереработкаПоГрафикуПроизводства.КодСтрокиЭтапыГрафик КАК КодСтрокиЭтапыГрафик,
	|		МИНИМУМ(ПереработкаПоГрафикуПроизводства.Регистратор) КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.ПереработкаПоГрафикуПроизводства КАК ПереработкаПоГрафикуПроизводства
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЭтапыПереработки КАК ЭтапыПереработки
	|			ПО ПереработкаПоГрафикуПроизводства.ЗаказНаПроизводство = ЭтапыПереработки.Распоряжение
	|				И ПереработкаПоГрафикуПроизводства.КодСтрокиЭтапыГрафик = ЭтапыПереработки.КодСтрокиЭтапыГрафик
	|	ГДЕ
	|		ПереработкаПоГрафикуПроизводства.Активность
	|		И ПереработкаПоГрафикуПроизводства.Регистратор ССЫЛКА Документ.ЗаказПереработчику
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПереработкаПоГрафикуПроизводства.ЗаказНаПроизводство,
	|		ПереработкаПоГрафикуПроизводства.КодСтрокиЭтапыГрафик) КАК ПереработкаПоГрафикуПроизводства
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПереработчику КАК ЗаказПереработчику
	|	ПО ПереработкаПоГрафикуПроизводства.Регистратор = ЗаказПереработчику.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереработкаПоГрафикуПроизводства.Регистратор КАК Регистратор,
	|	ПереработкаПоГрафикуПроизводства.Период      КАК Период,
	|	ОстаткиЭтапов.Распоряжение                   КАК Распоряжение,
	|	ОстаткиЭтапов.КодСтрокиПродукция             КАК КодСтрокиПродукция,
	|	ОстаткиЭтапов.КодСтрокиЭтапыГрафик           КАК КодСтрокиЭтапыГрафик,
	|	ОстаткиЭтапов.Этап                           КАК Этап,
	|	ОстаткиЭтапов.Подразделение                  КАК Подразделение,
	|	ОстаткиЭтапов.ЗапланированоОстаток           КАК ЗапланированоОстаток
	|ИЗ
	|	ВТ_ПереработкаПоГрафикуПроизводства КАК ПереработкаПоГрафикуПроизводства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОстаткиЭтапов КАК ОстаткиЭтапов
	|		ПО ПереработкаПоГрафикуПроизводства.Распоряжение = ОстаткиЭтапов.Распоряжение
	|			И ПереработкаПоГрафикуПроизводства.КодСтрокиЭтапыГрафик = ОстаткиЭтапов.КодСтрокиЭтапыГрафик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	Распоряжение,
	|	КодСтрокиПродукция,
	|	КодСтрокиЭтапыГрафик,
	|	Этап,
	|	Подразделение");
	
	Запрос.УстановитьПараметр("ТаблицаЭтаповГрафика", ТаблицаЭтаповГрафика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЕстьЗаписиВВыборке = Выборка.Следующий();
	
	НаборЗаписей = РегистрыНакопления.ЭтапыПроизводства.СоздатьНаборЗаписей();
	
	Пока ЕстьЗаписиВВыборке Цикл

		ТекРегистратор = Выборка.Регистратор;
		
		// Чтение существующего набора
		НаборЗаписей.Отбор.Регистратор.Установить(ТекРегистратор);
		НаборЗаписей.Прочитать();
		
		Пока ЕстьЗаписиВВыборке И Выборка.Регистратор = ТекРегистратор Цикл
			
			Запись = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(Запись, Выборка, "Период,Распоряжение,КодСтрокиПродукция,КодСтрокиЭтапыГрафик,Этап,Подразделение");
			
			Запись.ПроизводствоНаСтороне = Истина;
			Запись.Выполнено             = Выборка.ЗапланированоОстаток;
			
			// Переход к следующей записи в выборке.
			ЕстьЗаписиВВыборке = Выборка.Следующий();

		КонецЦикла;
		
		// Запись и очистка набора.
		Если ВызовИзОбработчикаОбновления Тогда

			Попытка

				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);

			Исключение

				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(Выборка.Регистратор);
				ВызватьИсключение;

			КонецПопытки;

		Иначе
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
		НаборЗаписей.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ИмяРегистра = "ПереработкаПоГрафикуПроизводства";
	ПолноеИмяРегистра = "РегистрНакопления.ПереработкаПоГрафикуПроизводства";
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить("Документ.ЗаказПереработчику");
	
	Для Каждого ПолноеИмяДокумента Из СписокДокументов Цикл
		ИмяДокумента = СтрРазделить(ПолноеИмяДокумента, ".")[1];
		ТекстЗапросаМеханизмаПроведения = Документы[ИмяДокумента].АдаптированныйТекстЗапросаДвиженийПоРегистру(ИмяРегистра);
		Регистраторы = ОбновлениеИнформационнойБазыУТ.РегистраторыДляПерепроведения(
			ТекстЗапросаМеханизмаПроведения,
			ПолноеИмяРегистра,
			ПолноеИмяДокумента);
		
		ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ПереработкаПоГрафикуПроизводства";
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.ЗаказПереработчику");
	
	ОбновлениеИнформационнойБазыУТ.ПерезаписатьДвиженияИзОчереди(Регистраторы, ПолноеИмяРегистра, Параметры.Очередь);
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
